; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_12 ?v11 ?v4)
             (pred_2 ?v7 ?v13)
             (pred_1 ?v11 ?v13)
             (pred_4 ?v12 ?v11 )
	     (pred_3 ?v11)
             (pred_8 ?v5)
             (pred_6 ?v7)
             (pred_9 ?v13)
             (pred_10 ?v11)
             (pred_7 ?v7)
             (pred_5 ?v11)
             (pred_11 ))



(:action op_2
:parameters (?v9 ?v1 ?v6 ?v8)
:precondition (and (pred_8 ?v9) (pred_8 ?v1) (pred_6 ?v6) (pred_9 ?v8)
          (pred_12 ?v9 ?v1) (pred_2 ?v6 ?v8)
                   (pred_1 ?v1 ?v8) (pred_3 ?v9) 
                   (pred_10 ?v1) (pred_7 ?v6))
:effect (and  (pred_5 ?v1) (not (pred_10 ?v1))))


(:action op_1
:parameters (?v9 ?v10)
:precondition (and (pred_8 ?v9) (pred_8 ?v10)
               (pred_3 ?v9) (pred_12 ?v9 ?v10) (pred_5 ?v10))
:effect (and (pred_3 ?v10) (not (pred_3 ?v9))))

(:action op_4
:parameters (?v9 ?v6)
:precondition (and (pred_8 ?v9) (pred_6 ?v6) 
                  (pred_3 ?v9) (pred_4 ?v6 ?v9) (pred_11 ))
:effect (and (pred_7 ?v6)
   (not (pred_4 ?v6 ?v9)) (not (pred_11 ))))


(:action op_3
:parameters (?v9 ?v3 ?v2)
:precondition (and (pred_8 ?v9) (pred_6 ?v3) (pred_6 ?v2)
                  (pred_3 ?v9) (pred_7 ?v2) (pred_4 ?v3 ?v9))
:effect (and (pred_7 ?v3) (pred_4 ?v2 ?v9)
        (not (pred_7 ?v2)) (not (pred_4 ?v3 ?v9))))

(:action op_5
:parameters (?v9 ?v6)
:precondition (and (pred_8 ?v9) (pred_6 ?v6) 
                  (pred_3 ?v9) (pred_7 ?v6))
:effect (and (pred_11 ) (pred_4 ?v6 ?v9) (not (pred_7 ?v6)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_13 obj_04 obj_01 obj_15 obj_12 obj_18 obj_11 obj_10 obj_07 obj_02 obj_17 obj_22 obj_19 obj_03 obj_08 obj_20
    obj_05 obj_06 obj_14
    obj_09 obj_16 obj_21
    )

    (:init
       (pred_11)

       (pred_8 obj_13)
       (pred_8 obj_04)
       (pred_8 obj_01)
       (pred_8 obj_15)
       (pred_8 obj_12)
       (pred_8 obj_18)
       (pred_8 obj_11)
       (pred_8 obj_10)
       (pred_8 obj_07)
       (pred_8 obj_02)
       (pred_8 obj_17)
       (pred_8 obj_22)
       (pred_8 obj_19)
       (pred_8 obj_03)
       (pred_8 obj_08)
       (pred_8 obj_20)
       (pred_9 obj_05)
       (pred_9 obj_06)
       (pred_9 obj_14)
       (pred_6 obj_09)
       (pred_6 obj_16)
       (pred_6 obj_21)

       (pred_12 obj_13 obj_12)
       (pred_12 obj_13 obj_04)
       (pred_12 obj_04 obj_18)
       (pred_12 obj_04 obj_01)
       (pred_12 obj_04 obj_13)
       (pred_12 obj_01 obj_11)
       (pred_12 obj_01 obj_15)
       (pred_12 obj_01 obj_04)
       (pred_12 obj_15 obj_10)
       (pred_12 obj_15 obj_01)
       (pred_12 obj_12 obj_07)
       (pred_12 obj_12 obj_18)
       (pred_12 obj_12 obj_13)
       (pred_12 obj_18 obj_02)
       (pred_12 obj_18 obj_11)
       (pred_12 obj_18 obj_04)
       (pred_12 obj_18 obj_12)
       (pred_12 obj_11 obj_17)
       (pred_12 obj_11 obj_10)
       (pred_12 obj_11 obj_01)
       (pred_12 obj_11 obj_18)
       (pred_12 obj_10 obj_22)
       (pred_12 obj_10 obj_15)
       (pred_12 obj_10 obj_11)
       (pred_12 obj_07 obj_19)
       (pred_12 obj_07 obj_02)
       (pred_12 obj_07 obj_12)
       (pred_12 obj_02 obj_03)
       (pred_12 obj_02 obj_17)
       (pred_12 obj_02 obj_18)
       (pred_12 obj_02 obj_07)
       (pred_12 obj_17 obj_08)
       (pred_12 obj_17 obj_22)
       (pred_12 obj_17 obj_11)
       (pred_12 obj_17 obj_02)
       (pred_12 obj_22 obj_20)
       (pred_12 obj_22 obj_10)
       (pred_12 obj_22 obj_17)
       (pred_12 obj_19 obj_03)
       (pred_12 obj_19 obj_07)
       (pred_12 obj_03 obj_08)
       (pred_12 obj_03 obj_02)
       (pred_12 obj_03 obj_19)
       (pred_12 obj_08 obj_20)
       (pred_12 obj_08 obj_17)
       (pred_12 obj_08 obj_03)
       (pred_12 obj_20 obj_22)
       (pred_12 obj_20 obj_08)
       (pred_10 obj_13)
       (pred_10 obj_02)
       (pred_10 obj_22)
       (pred_1  obj_13 obj_05)
       (pred_1  obj_02 obj_06)
       (pred_1  obj_22 obj_14)
       (pred_5 obj_04)
       (pred_5 obj_01)
       (pred_5 obj_15)
       (pred_5 obj_12)
       (pred_5 obj_18)
       (pred_5 obj_11)
       (pred_5 obj_10)
       (pred_5 obj_07)
       (pred_5 obj_17)
       (pred_5 obj_19)
       (pred_5 obj_03)
       (pred_5 obj_08)
       (pred_5 obj_20)

       (pred_2  obj_09 obj_05)
       (pred_2  obj_16 obj_06)
       (pred_2  obj_21 obj_14)
       (pred_4 obj_09 obj_04)
       (pred_4 obj_16 obj_15)
       (pred_4 obj_21 obj_10)
       (pred_3 obj_12)
    )

    (:goal (and
       (pred_4 obj_09 obj_12)
       (pred_4 obj_16 obj_03)
    ))
(:constraints
  (always (not (pred_3 obj_18)))
)
)

; plan
1. (op_1 obj_12 obj_07)
   deleted: (pred_3 obj_12)
   added: (pred_3 obj_07)
   goals met: 0 of 2
2. (op_1 obj_07 obj_19)
   deleted: (pred_3 obj_07)
   added: (pred_3 obj_19)
   goals met: 0 of 2
3. (op_1 obj_19 obj_03)
   deleted: (pred_3 obj_19)
   added: (pred_3 obj_03)
   goals met: 0 of 2
4. (op_1 obj_03 obj_08)
   deleted: (pred_3 obj_03)
   added: (pred_3 obj_08)
   goals met: 0 of 2
5. (op_1 obj_08 obj_17)
   deleted: (pred_3 obj_08)
   added: (pred_3 obj_17)
   goals met: 0 of 2
6. (op_1 obj_17 obj_11)
   deleted: (pred_3 obj_17)
   added: (pred_3 obj_11)
   goals met: 0 of 2
7. (op_1 obj_11 obj_01)
   deleted: (pred_3 obj_11)
   added: (pred_3 obj_01)
   goals met: 0 of 2
8. (op_1 obj_01 obj_15)
   deleted: (pred_3 obj_01)
   added: (pred_3 obj_15)
   goals met: 0 of 2
9. (op_4 obj_15 obj_16)
   deleted: (pred_4 obj_16 obj_15) (pred_11)
   added: (pred_7 obj_16)
   goals met: 0 of 2
10. (op_1 obj_15 obj_01)
   deleted: (pred_3 obj_15)
   added: (pred_3 obj_01)
   goals met: 0 of 2
11. (op_1 obj_01 obj_04)
   deleted: (pred_3 obj_01)
   added: (pred_3 obj_04)
   goals met: 0 of 2
12. (op_3 obj_04 obj_09 obj_16)
   deleted: (pred_7 obj_16) (pred_4 obj_09 obj_04)
   added: (pred_7 obj_09) (pred_4 obj_16 obj_04)
   goals met: 0 of 2
13. (op_2 obj_04 obj_13 obj_09 obj_05)
   deleted: (pred_10 obj_13)
   added: (pred_5 obj_13)
   goals met: 0 of 2
14. (op_1 obj_04 obj_13)
   deleted: (pred_3 obj_04)
   added: (pred_3 obj_13)
   goals met: 0 of 2
15. (op_1 obj_13 obj_12)
   deleted: (pred_3 obj_13)
   added: (pred_3 obj_12)
   goals met: 0 of 2
16. (op_5 obj_12 obj_09)
   deleted: (pred_7 obj_09)
   added: (pred_11) (pred_4 obj_09 obj_12)
   goals met: 1 of 2
17. (op_1 obj_12 obj_13)
   deleted: (pred_3 obj_12)
   added: (pred_3 obj_13)
   goals met: 1 of 2
18. (op_1 obj_13 obj_04)
   deleted: (pred_3 obj_13)
   added: (pred_3 obj_04)
   goals met: 1 of 2
19. (op_4 obj_04 obj_16)
   deleted: (pred_4 obj_16 obj_04) (pred_11)
   added: (pred_7 obj_16)
   goals met: 1 of 2
20. (op_1 obj_04 obj_13)
   deleted: (pred_3 obj_04)
   added: (pred_3 obj_13)
   goals met: 1 of 2
21. (op_1 obj_13 obj_12)
   deleted: (pred_3 obj_13)
   added: (pred_3 obj_12)
   goals met: 1 of 2
22. (op_1 obj_12 obj_07)
   deleted: (pred_3 obj_12)
   added: (pred_3 obj_07)
   goals met: 1 of 2
23. (op_1 obj_07 obj_19)
   deleted: (pred_3 obj_07)
   added: (pred_3 obj_19)
   goals met: 1 of 2
24. (op_1 obj_19 obj_03)
   deleted: (pred_3 obj_19)
   added: (pred_3 obj_03)
   goals met: 1 of 2
25. (op_5 obj_03 obj_16)
   deleted: (pred_7 obj_16)
   added: (pred_11) (pred_4 obj_16 obj_03)
   goals met: 2 of 2
